group-reports/sharif/results/10G-disk-throughput-tuning-protocol-B-sndbuf-2k/test-2.txt
write-sequentially-test-job: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
write-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

write-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=31502: Fri Jul 14 01:26:55 2023
  write: IOPS=2, BW=9655KiB/s (9887kB/s)(5716MiB/606204msec)
    slat (usec): min=32, max=395, avg=152.85, stdev=48.72
    clat (msec): min=626, max=12063, avg=6782.29, stdev=1248.02
     lat (msec): min=627, max=12063, avg=6782.44, stdev=1248.02
    clat percentiles (msec):
     |  1.00th=[ 4144],  5.00th=[ 4933], 10.00th=[ 5269], 20.00th=[ 5738],
     | 30.00th=[ 6141], 40.00th=[ 6342], 50.00th=[ 6678], 60.00th=[ 6946],
     | 70.00th=[ 7349], 80.00th=[ 7752], 90.00th=[ 8356], 95.00th=[ 8792],
     | 99.00th=[ 9866], 99.50th=[10402], 99.90th=[11610], 99.95th=[12013],
     | 99.99th=[12013]
   bw (  KiB/s): min= 8175, max=49152, per=100.00%, avg=11523.80, stdev=5747.73, samples=1005
   iops        : min=    1, max=   12, avg= 2.73, stdev= 1.42, samples=1005
  lat (msec)   : 750=0.07%, 1000=0.07%
  cpu          : usr=0.23%, sys=0.04%, ctx=1430, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.3%, 8=0.6%, 16=99.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1429,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=9655KiB/s (9887kB/s), 9655KiB/s-9655KiB/s (9887kB/s-9887kB/s), io=5716MiB (5994MB), run=606204-606204msec

Disk stats (read/write):
    drbd1: ios=0/11459, merge=0/0, ticks=0/75265389, in_queue=75265389, util=99.67%, aggrios=0/12876, aggrmerge=0/0, aggrticks=0/185129, aggrin_queue=185129, aggrutil=4.96%
    dm-0: ios=0/12876, merge=0/0, ticks=0/185129, in_queue=185129, util=4.96%, aggrios=0/12873, aggrmerge=0/3, aggrticks=0/185540, aggrin_queue=179110, aggrutil=4.96%
  sde: ios=0/12873, merge=0/3, ticks=0/185540, in_queue=179110, util=4.96%