group-reports/sharif/results/10G-disk-throughput-tuning-protocol-B-sndbuf-2k/test-3.txt
read-randomly-test-job: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
read-randomly-test-job: Laying out IO file (1 file / 10240MiB)

read-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=35353: Fri Jul 14 01:54:44 2023
   read: IOPS=72.4k, BW=566MiB/s (593MB/s)(332GiB/600002msec)
    slat (usec): min=2, max=326610, avg=212.84, stdev=589.64
    clat (usec): min=207, max=598415, avg=3319.82, stdev=2494.93
     lat (usec): min=215, max=598419, avg=3532.90, stdev=2582.87
    clat percentiles (usec):
     |  1.00th=[  701],  5.00th=[ 1303], 10.00th=[ 1663], 20.00th=[ 2114],
     | 30.00th=[ 2474], 40.00th=[ 2802], 50.00th=[ 3097], 60.00th=[ 3425],
     | 70.00th=[ 3818], 80.00th=[ 4293], 90.00th=[ 5080], 95.00th=[ 5866],
     | 99.00th=[ 8160], 99.50th=[ 9372], 99.90th=[14091], 99.95th=[17171],
     | 99.99th=[39584]
   bw (  KiB/s): min=  384, max=51424, per=6.25%, avg=36215.31, stdev=4745.63, samples=19194
   iops        : min=   48, max= 6428, avg=4526.89, stdev=593.20, samples=19194
  lat (usec)   : 250=0.01%, 500=0.39%, 750=0.83%, 1000=1.40%
  lat (msec)   : 2=14.22%, 4=57.43%, 10=25.36%, 20=0.35%, 50=0.02%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=1.39%, sys=5.66%, ctx=23724053, majf=0, minf=662
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=43466052,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=566MiB/s (593MB/s), 566MiB/s-566MiB/s (593MB/s-593MB/s), io=332GiB (356GB), run=600002-600002msec

Disk stats (read/write):
    drbd1: ios=43454223/6, merge=0/0, ticks=52601384/16, in_queue=52601400, util=100.00%, aggrios=43466055/6, aggrmerge=0/0, aggrticks=52550978/16, aggrin_queue=52550994, aggrutil=100.00%
    dm-0: ios=43466055/6, merge=0/0, ticks=52550978/16, in_queue=52550994, util=100.00%, aggrios=43465943/6, aggrmerge=112/0, aggrticks=43608941/15, aggrin_queue=20004222, aggrutil=100.00%
  sde: ios=43465943/6, merge=112/0, ticks=43608941/15, in_queue=20004222, util=100.00%